#מחרוזות ניתן לחבר כמו מספרים


#מחרוזות לא ניתן לחבר עם מספרים

#אבל ניתן להטמין פורמטרים במחרוזות
print("p1={}, p2={}, p3={}, p4={red}. format(1, 1.0, object(), red='#ff0000")

#ירידת שורה n\
print("line 1 \n\n\n now in down 3 lines")

#TAB t\
#print("def goku(attack):\n\tprint (attack)\n")

#בדיקה עם מחרוזת קיימת בתוך מחרוזת
print("idan" in "idan hakimi")

s1= "012345"
#5 התו האחרון
print(s1[-1])

#0 התו הראשון
print(s1[0])

#1234 (כל התווים מהתו הראשון1 {:עד לא כולל} האחרון 1-)
print(s1[1:-1])

#3 התו הרביעי
print(s1[3])

#ספירה הפוכה (אם התו הראשון0 אז מינוס שווה לתו האחרון=5 כלומר ללכת מהסוף להתחלה)
# 5
print(s1[-1])
# 4
print(s1[-2])

#invalid syntax print(s1[]) insted type as shown below for 012345
print(s1[:])

#024 להדפיס הכל[:] בקפיצות{::} של 2)
print(s1[::2])

#24 להדפיס החל מהתו :2 עד כלום :: בקפיצות של 2:
print(s1[2::2])

# 543210 להדפיס הכל :: בקפיצות של 1- (כלומר מ5 להדפיס במינוס=לאחור)
print(s1[::-1])

'''
p1={}, p2={}, p3={}, p4={red}. format(1, 1.0, object(), red='#ff0000
line 1 


 now in down 3 lines
True
5
0
1234
3
5
4
012345
024
24
543210
'''